ci4/app/Controllers/Artikel.php

    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where([
        'slug' => $slug
        ])->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'timnas-indonesia-menang-kualifikasi'
 LIMIT 1