ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10
SELECT *
FROM `kategori`
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        $data = [
            'title' => $title,
            'q' => $q,
            'kategori_id' => $kategori_id,
        ];

        $builder = $model->table('artikel')
                    ->select('artikel.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }
        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $data['artikel'] = $builder->paginate(10);
        $data['pager'] = $model->pager;

        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---
    public function add()
    {
        if ($this->request->getMethod() == 'post' && $this->validate([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ])) {
            $kategoriModel = new KategoriModel();
            $kategori = $kategoriModel->find($this->request->getPost('id_kategori'));

            $model = new ArtikelModel();
            $model->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'kategori' => $kategori ? $kategori['nama_kategori'] : null,
                'gambar' => null,
                'status' => 1,  // langsung aktif supaya muncul
                'created_at' => date('Y-m-d H:i:s'),
            ]);
            return redirect()->to('/admin/artikel');
        } else {
            $kategoriModel = new KategoriModel();
            $data = [
                'title' => 'Tambah Artikel',
                'kategori' => $kategoriModel->findAll(),

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        $model = new ArtikelModel();

        if ($this->request->getMethod() == 'post' && $this->validate([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ])) {
            $kategoriModel = new KategoriModel();
            $kategori = $kategoriModel->find($this->request->getPost('id_kategori'));

            $model->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'kategori' => $kategori ? $kategori['nama_kategori'] : null,
            ]);
            return redirect()->to('/admin/artikel');
        } else {
            $artikel = $model->find($id);
            $kategoriModel = new KategoriModel();
            $data = [
                'title' => 'Edit Artikel',
                'kategori' => $kategoriModel->findAll(),